In [13]:
# Adding autoreload will let you edit your package and see the changes without restarting the notebook.

%load_ext autoreload

%autoreload 2

%matplotlib inline

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [98]:
import pandas as pd
from datetime import datetime

In [99]:
DELIVERIES_PATH = "../data/raw/deliveries.jsonl"
SESSIONS_PATH = "../data/raw/sessions.jsonl"
USERS_PATH = "../data/raw/users.jsonl"
PRODUCTS_PATH = "../data/raw/products.jsonl"

In [100]:
def load_data(path: str) -> pd.DataFrame:
    return pd.read_json(path_or_buf=path, lines=True)

In [101]:
deliv_df = load_data(DELIVERIES_PATH)
sess_df = load_data(SESSIONS_PATH)
usr_df = load_data(USERS_PATH)
prod_df = load_data(PRODUCTS_PATH)

In [102]:
dfs = [deliv_df, usr_df, sess_df, prod_df]
for df in dfs:
    df.info();
    print()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5182 entries, 0 to 5181
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   purchase_id         5182 non-null   int64
 1   purchase_timestamp  5182 non-null   object
 2   delivery_timestamp  4929 non-null   object
 3   delivery_company    4928 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 162.1+ KB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  200 non-null    int64
 1   name     200 non-null    object
 2   city     200 non-null    object
 3   street   200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37246 entries, 0 to 37245
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   session_id        37246 non-null  int64
 1   timestamp         37246 non-null  datetime64[ns]
 2   user_id           35463 non-null  float64
 3   product_id        35413 non-null  float64
 4   event_type        37246 non-null  object
 5   offered_discount  37246 non-null  int64
 6   purchase_id       5182 non-null   float64
dtypes: datetime64[ns](1), float64(3), int64(2), object(1)
memory usage: 2.0+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 319 entries, 0 to 318
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     319 non-null    int64
 1   product_name   319 non-null    object
 2   category_path  319 non-null    object
 3   price          319 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 10.1+ KB

In [103]:

sess_df.dropna(subset=["user_id"], inplace=True)
sess_df.user_id = sess_df.user_id.astype(int)
sess_df

,session_id,timestamp,user_id,product_id,event_type,offered_discount,purchase_id
0,100001,2021-08-30 18:06:31,102,1001.0,VIEW_PRODUCT,0,NaN
1,100002,2021-08-28 04:15:09,102,1037.0,VIEW_PRODUCT,20,NaN
2,100003,2021-08-24 16:20:45,102,1035.0,VIEW_PRODUCT,15,NaN
3,100003,2021-08-24 16:24:51,102,1067.0,VIEW_PRODUCT,15,NaN
4,100004,2021-10-22 00:50:51,102,1283.0,VIEW_PRODUCT,5,NaN
...,...,...,...,...,...,...,...
37241,110416,2021-09-05 17:32:12,301,1277.0,VIEW_PRODUCT,10,NaN
37242,110416,2021-09-05 17:33:30,301,1276.0,VIEW_PRODUCT,10,NaN
37243,110416,2021-09-05 17:36:21,301,1276.0,BUY_PRODUCT,10,25181.0
37244,110417,2021-07-30 11:52:43,301,1318.0,VIEW_PRODUCT,5,NaN
37245,110417,2021-07-30 11:55:20,301,1318.0,BUY_PRODUCT,5,25182.0

In [105]:
sess_df.product_id = sess_df.product_id.astype(pd.Int64Dtype())
sess_df.dropna(subset=["product_id"], inplace=True)
main = sess_df.merge(prod_df).merge(usr_df)
main

,session_id,timestamp,user_id,product_id,event_type,offered_discount,purchase_id,product_name,category_path,price,name,city,street
0,100001,2021-08-30 18:06:31,102,1001,VIEW_PRODUCT,0,NaN,Telefon Siemens Gigaset DA310,Telefony i akcesoria;Telefony stacjonarne,58.97,Inga Jeka,Gdynia,plac Wspólna 05
1,100034,2021-08-21 13:26:04,102,1001,VIEW_PRODUCT,5,NaN,Telefon Siemens Gigaset DA310,Telefony i akcesoria;Telefony stacjonarne,58.97,Inga Jeka,Gdynia,plac Wspólna 05
2,100052,2021-10-15 20:57:04,102,1001,VIEW_PRODUCT,15,NaN,Telefon Siemens Gigaset DA310,Telefony i akcesoria;Telefony stacjonarne,58.97,Inga Jeka,Gdynia,plac Wspólna 05
3,100062,2021-09-13 15:24:06,102,1001,VIEW_PRODUCT,15,NaN,Telefon Siemens Gigaset DA310,Telefony i akcesoria;Telefony stacjonarne,58.97,Inga Jeka,Gdynia,plac Wspólna 05
4,100062,2021-09-13 15:24:42,102,1001,BUY_PRODUCT,15,20026.0,Telefon Siemens Gigaset DA310,Telefony i akcesoria;Telefony stacjonarne,58.97,Inga Jeka,Gdynia,plac Wspólna 05
...,...,...,...,...,...,...,...,...,...,...,...,...,...
33700,106758,2021-10-25 19:20:30,230,1004,VIEW_PRODUCT,10,NaN,Fallout 3 (Xbox 360),Gry i konsole;Gry na konsole;Gry Xbox 360,49.99,Aleksander Bartel,Kraków,plac Orzechowa 82
33701,106758,2021-10-25 19:07:53,230,1009,VIEW_PRODUCT,10,NaN,Kinect Joy Ride (Xbox 360),Gry i konsole;Gry na konsole;Gry Xbox 360,69.00,Aleksander Bartel,Kraków,plac Orzechowa 82
33702,106758,2021-10-25 19:28:47,230,1007,VIEW_PRODUCT,10,NaN,Dead Space 3 (Xbox 360),Gry i konsole;Gry na konsole;Gry Xbox 360,89.99,Aleksander Bartel,Kraków,plac Orzechowa 82
33703,106758,2021-10-25 19:07:23,230,1010,VIEW_PRODUCT,10,NaN,BioShock 2 (Xbox 360),Gry i konsole;Gry na konsole;Gry Xbox 360,89.99,Aleksander Bartel,Kraków,plac Orzechowa 82
33704,106758,2021-10-25 19:24:38,230,1005,VIEW_PRODUCT,10,NaN,Szalone Króliki Na żywo i w kolorze (Xbox 360),Gry i konsole;Gry na konsole;Gry Xbox 360,49.99,Aleksander Bartel,Kraków,plac Orzechowa 82

In [46]:
# sess_df = sess_df[sess_df.user_id.notnull()].drop(["session_id", "purchase_id"], axis=1).reindex()
# sess_df

                timestamp  user_id  product_id    event_type  offered_discount
0     2021-08-30 18:06:31    102.0      1001.0  VIEW_PRODUCT                 0
1     2021-08-28 04:15:09    102.0      1037.0  VIEW_PRODUCT                20
2     2021-08-24 16:20:45    102.0      1035.0  VIEW_PRODUCT                15
3     2021-08-24 16:24:51    102.0      1067.0  VIEW_PRODUCT                15
4     2021-10-22 00:50:51    102.0      1283.0  VIEW_PRODUCT                 5
...                   ...      ...         ...           ...               ...
37241 2021-09-05 17:32:12    301.0      1277.0  VIEW_PRODUCT                10
37242 2021-09-05 17:33:30    301.0      1276.0  VIEW_PRODUCT                10
37243 2021-09-05 17:36:21    301.0      1276.0   BUY_PRODUCT                10
37244 2021-07-30 11:52:43    301.0      1318.0  VIEW_PRODUCT                 5
37245 2021-07-30 11:55:20    301.0      1318.0   BUY_PRODUCT                 5

[35463 rows x 5 columns]

In [132]:
usr_df["is_male"] = usr_df.name.apply(lambda name_str: int(name_str.split()[0][-1]!="a"))

In [133]:
usr_df.nunique()

user_id    200
name       200
city         7
street     200
is_male      2
dtype: int64

In [134]:
usr_df.drop(["name", "street"],axis=1, inplace=True)

In [135]:
usr_df

     user_id     city  is_male
0        102   Gdynia        0
1        103   Kraków        0
2        104    Radom        1
3        105   Poznań        0
4        106   Poznań        1
..       ...      ...      ...
195      297  Wrocław        0
196      298   Kraków        1
197      299  Wrocław        1
198      300   Gdynia        1
199      301   Poznań        0

[200 rows x 3 columns]